#include "titlewidget.h"
#include "ui_titlewidget.h"
/****************************************************************************
**
** 函数名称：TitleWidget::TitleWidget
** 功能概述: 初始化
** 参数说明 
** 作成日期：20151113
** 作成者：  HSCN
** 修改日期：20151113
** 修改者：  HSCN
**
****************************************************************************/
TitleWidget::TitleWidget(QWidget* parent) :
    QWidget(parent),
    ui(new Ui::TitleWidget)
{
    ui->setupUi(this);
    ui->label->adjustSize();
}
/****************************************************************************
**
** 函数名称：TitleWidget::~TitleWidget
** 功能概述: 析构函数
** 参数说明 
** 作成日期：20151113
** 作成者：  HSCN
** 修改日期：20151113
** 修改者：  HSCN
**
****************************************************************************/
TitleWidget::~TitleWidget()
{
    delete ui;
}
/****************************************************************************
**
** 函数名称：TitleWidget::setText
** 功能概述: 设置标题内容
** 参数说明 
** 作成日期：20151113
** 作成者：  HSCN
** 修改日期：20151113
** 修改者：  HSCN
**
****************************************************************************/
void TitleWidget::setText(QString text)
{
    ui->label->setText(text);
}
